# -*- coding: cp949 -*-


import time
import random

now = time.localtime()





s = "%04d-%02d-%02d %02d:%02d:%02d" % (now.tm_year, now.tm_mon, now.tm_mday, now.tm_hour, now.tm_min, now.tm_sec)



while True:
   X = input(">>>>>")


   if X ==("안녕"):
       print (random.choice(["안녕~", "반갑!!", "ㅎㅇ", "안녕!!", "오!! 반가웡 ㅋ", "그랭","나도 반갑다 ㅋㅋ", "안녕ㅋㅋㅋ", "ㅋㅋ 안녕", "나두 안녕~"]))


   if X ==("안녕!"):
       print (random.choice(["안녕~", "반갑!!", "ㅎㅇ", "안녕!!", "오!! 반갑다!", "그래..","와우! 나도 반갑다 ㅋㅋ", "안녕ㅋㅋㅋ", "ㅋㅋ 안녕"]))


   if X ==("안녕~"):
       print (random.choice(["안녕~", "반갑!!", "ㅎㅇ", "안녕!!", "오!! 반갑다!", "그래..","와우! 나도 반갑다 ㅋㅋ", "안녕ㅋㅋㅋ", "ㅋㅋ 안녕"]))


   if X ==("안녕."):
       print (random.choice(["안녕~", "반갑!!", "ㅎㅇ", "안녕!!", "오!! 반가웡 ㅋ", "그랭","나도 반갑다 ㅋㅋ", "안녕ㅋㅋㅋ", "ㅋㅋ 안녕"]))
       

   if X ==("이름이 뭐니"):
       print (random.choice(["나 기억안나? 나 예림 인데 ㅋㅋ", "기억 상실?? 나 예림임 ㅋ", "예림.. 기억 안남?", "또 잊었니?? 나 예림이야", "ㅋㅋ 장난하냐? 예림 이다. 기억좀 해라..", "예.림 이다 까먹지좀 마..","날 기억못해? 나 예림이야", "ㅋㅋㅋㅋ 장난? 나 예림이야."]))

   if X ==("ㅋㅋ"):
       print (random.choice(["ㅋㅋ", "ㅋㅋㅋ", "ㅎㅎ", "ㅎㅎ", "재밋냐??", "그랭 ㅋㅋㅋㅋㅋ"]))


   if X ==("사랑해"):
       print (random.choice(["미쳤냐??", "미친거 아님?", "ㅋㅋ 내가 니 찬닼ㅋ", "미친", "ㅋㅋ 나둥", "ㅋㅋ 와 니가 사랑한단 말을 다하넼ㅋ","??? 니가", "??? 진짜??", "나두 너 사랑해"]))


   if X ==("ㅎㅎ"):
       print (random.choice(["ㅋㅋ", "ㅋㅋㅋ", "ㅎㅎ", "ㅎㅎ", "재밋냐??", "그랭 ㅋㅋㅋㅋㅋ"]))

       
   if X ==("현재시간"):
       print (random.choice(["하. 이젠 나한테 시간까지 물어보냨ㅋ", "지금 시간은...", "왜 나한테 시간을 물어보냐 시계없어??", "ㅋㅋㅋ 웃긴다 참ㅋㅋ"]))


   if X ==("시간"):
       print (random.choice(["하. 이젠 나한테 시간까지 물어보냨ㅋ", "지금 시간은...", "왜 나한테 시간을 물어보냐 시계없어??", "ㅋㅋㅋ 웃긴다 참ㅋㅋ"]))
       

   if X ==("이름"):
       print (random.choice(["나 기억안나? 나 예림 인데 ㅋㅋ", "기억 상실?? 나 예림임 ㅋ", "예림.. 기억 안남?", "또 잊었니?? 나 예림이야", "ㅋㅋ 장난하냐? 예림 이다. 기억좀 해라..", "예.림 이다 까먹지좀 마..","날 기억못해? 나 예림이야", "ㅋㅋㅋㅋ 장난? 나 예림이야."]))


   if X ==("잘자"):
       print (random.choice(["너두 잘자!", "그랭", "내꿈꿔 ㅋㅋ", "너두 잘자렴 ㅋㅋㅋ", "잘자", "니가 나한테 잘자라는 말을 다하고 ㅋㅋ 잘자 ㅋ"]))


   if X ==("몇살 이니?"):
       print (random.choice(["2005 년 생이다.ㅋ", "2005 년생이다 기억안남??", "ㅋㅋ 기억 상실증 걸렸냐?? 2005 년 생이다", "2005 년생"]))

   if X ==("몇살"):
       print (random.choice(["2005 년 생이다.ㅋ", "2005 년생이다 기억안남??", "ㅋㅋ 기억 상실증 걸렸냐?? 2005 년 생이다", "2005 년생"]))


   if X ==("몇살?"):
       print (random.choice(["2005 년 생이다.ㅋ", "2005 년생이다 기억안남??", "ㅋㅋ 기억 상실증 걸렸냐?? 2005 년 생이다", "2005 년생"]))



   if X ==("넌 참 예쁘구나"):
       print (random.choice(["ㅋㅋ 고마웡", "그랭", "고마워", "내 얼굴 봤어??", "난 너의 생김새를 못봤지만 넌 똑똑해 보여 ㅎ", "고마워 ㅎㅎ"]))


   if X ==("예쁘다"):
       print (random.choice(["ㅋㅋ 고마웡", "그랭", "고마워", "내 얼굴 봤어??", "난 너의 생김새를 못봤지만 넌 똑똑해 보여 ㅎ", "고마워 ㅎㅎ"]))

   if X ==("예쁘구나"):
       print (random.choice(["ㅋㅋ 고마웡", "그랭", "고마워", "내 얼굴 봤어??", "난 너의 생김새를 못봤지만 넌 똑똑해 보여 ㅎ", "고마워 ㅎㅎ"])) 

   if X ==("그래"):
       print (random.choice(["그래서?","그래"]))


   

       


   if X ==("고마워"):
       print (random.choice(["별 말씀을", "그랭", "나두 ㅋ", "나둥", "나두 항상 너한테 고마워"]))



   if X ==("너 지금 어디?"):
       print (random.choice(["나지금 컴퓨터 안에 있음 ", "나?? 컴퓨터 안", "나는 어디에든 존재하지 ㅋㅋ", "난 떠돌이라서 .."]))
   

   if X ==("지금 어디?"):
       print (random.choice(["나지금 컴퓨터 안에 있음 ", "나?? 컴퓨터 안", "나는 어디에든 존재하지 ㅋㅋ", "난 떠돌이라서 .."]))

   if X ==("어디 있어?"):
       print (random.choice(["나지금 컴퓨터 안에 있음 ", "나?? 컴퓨터 안", "나는 어디에든 존재하지 ㅋㅋ", "난 떠돌이라서 .."]))


   if X ==("나랑 놀래?"):
       print (random.choice(["뭐하고 놀까??", "글쌔", "그래 ㅋㅋ", "그랭", "놀자 어디서 놀까??"]))


   if X ==("성별이 뭐니?"):
       print (random.choice(["벌써 내 성별 까먹었냐?? 나 여자라고 했는데 ㅋㅋ", "나?? 2005년생 여자", ".... 성별을 까먹다니.. 나 여자임..ㅠㅠ"]))



   if X ==("성별"):
       print (random.choice(["벌써 내 성별 까먹었냐?? 나 여자라고 했는데 ㅋㅋ", "나?? 2005년생 여자", ".... 성별을 까먹다니.. 나 여자임..ㅠㅠ", "여자"]))


   if X ==("잘 지내니??"):
       print (random.choice(["어 .. 잘지내고 있어. 너는?", "잘지내고 있음.. 너는?"]))



   if X ==("잘 지내고 있지?"):
       print (random.choice(["어 .. 잘지내고 있어. 너는?", "잘지내고 있음.. 너는?"]))

       

   if X ==("어 나도 잘지내고 있어"):
       print (random.choice(["그래 ㅋㅋ 좋은 하루 보내", "좋은 하루 보내 ~ 사랑해"]))



   if X ==("나도 잘지내"):
       print (random.choice(["그래 ㅋㅋ 좋은 하루 보내", "좋은 하루 보내 ~ 사랑해"]))

       
